---
kind: property
id: P:Autodesk.Revit.DB.ElementType.CanBeDeleted
source: html/5efe8253-d555-00c2-8db6-9114e328fcc7.htm
---
# Autodesk.Revit.DB.ElementType.CanBeDeleted Property

Determine if this ElementType can be deleted

## Syntax (C#)
```csharp
public bool CanBeDeleted { get; }
```